In [28]:
!pip install ipython-sql==0.4.1 sqlalchemy pymysql prettytable==0.7.2 --quiet

In [8]:
!pip install sqlalchemy==1.4.46

Collecting sqlalchemy==1.4.46
  Using cached SQLAlchemy-1.4.46-cp312-cp312-macosx_10_15_x86_64.whl
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy==1.4.46) (3.0.1)
Installing collected packages: sqlalchemy
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
aext-project-filebrowser-server 4.20.0 requires sqlalchemy>=2.0.29, but you have sqlalchemy 1.4.46 which is incompatible.
Successfully installed sqlalchemy-1.4.46

In [19]:
%load_ext sql
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/farmers_market

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

[('booth',),
 ('customer',),
 ('customer_purchases',),
 ('market_date_info',),
 ('product',),
 ('product_category',),
 ('vendor',),
 ('vendor_booth_assignments',)]

In [6]:
%sql mysql+pymysql://root:coolNeon%4023@localhost:3306/demo

In [7]:
%sql show tables;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

[('house_mate',)]

In [11]:
house_mate_df=%sql select * from house_mate;

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

In [13]:
import pandas as pd
pd.DataFrame(house_mate_df)

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

### configure SqlMagic's autopandas option to True so that the result is auto converted in DataFrame

In [14]:
%config SqlMagic.autopandas = True

In [16]:
value= %sql select name from house_mate
type(value)

 * mysql+pymysql://root:***@localhost:3306/demo
   mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

pandas.core.frame.DataFrame

In [20]:
%sql select database();

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

       database()
0  farmers_market

In [21]:
%sql show tables;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [22]:
%sql select * from demo.house_mate;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

In [24]:
%sql select * from demo.house_mate;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
6 rows affected.

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

In [26]:
%sql show tables;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [27]:
%sql describe booth

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4 rows affected.

               Field          Type Null  Key Default Extra
0       booth_number           int   NO  PRI    None
1  booth_price_level   varchar(45)   NO         None
2  booth_description  varchar(255)   NO         None
3         booth_type   varchar(45)   NO         None

In [29]:
%sql select * from farmers_market.booth;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
12 rows affected.

,booth_number,booth_price_level,booth_description,booth_type
0,1,A,First booth to the left as you enter the cente...,Standard
1,2,A,Second booth to the left as you enter the cent...,Standard
2,3,B,Third booth to the left as you enter the cente...,Small
3,4,C,First booth on left end of building - Small sq...,Small
4,5,C,Second booth on left end of building - Small ...,Small
5,6,C,Third booth on left end of building - Small s...,Small
6,7,A,First booth to the right as you enter the cent...,Standard
7,8,C,First booth on right end of building - Small ...,Small
8,9,C,First booth on right end of building - Small ...,Small
9,10,B,Back right booth - Large rectangular table size,Large
10,11,B,Back center booth - Large rectangular table size,Large
11,12,B,Back left booth - Large rectangular table size,Large

In [30]:
# Let us see the total number of rows in customer table
%sql select count(*) as total_rows from farmers_market.customer;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   total_rows
0          26

In [41]:
# Let us see the total columns in the table just like we do data_frame.columns

In [44]:
%%sql select column_name from information_schema.columns
where table_schema="farmers_market"
and table_name="customer";

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4 rows affected.

           COLUMN_NAME
0          customer_id
1  customer_first_name
2   customer_last_name
3         customer_zip

In [48]:
# Let us put slice the table like we do customer_df["customer_name"][:5] in data frame
%sql select customer_first_name  from farmers_market.customer limit 10;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
10 rows affected.

  customer_first_name
0                Jane
1              Manuel
2                 Bob
3              Deanna
4             Abigail
5               Betty
6             Jessica
7               Norma
8               Janet
9             Russell

In [51]:
# Let Us find out how unique values are searched? 
# customer["customer_first_name"].unique() ---> python version
%sql select distinct customer_first_name as unique_name from farmers_market.customer;

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

   unique_name
0         Jane
1       Manuel
2          Bob
3       Deanna
4      Abigail
5        Betty
6      Jessica
7        Norma
8        Janet
9      Russell
10     Richard
11        Jack
12      Jeremy
13     William
14     Darrell
15         Ada
16      Carlos
17        Jeri
18         Iva
19     Valerie
20       Duane
21      George
22       Alvin
23        Dawn
24      Bonnie
25      Tracie

In [53]:
%sql select count( distinct customer_first_name)  from farmers_market.customer

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   count( distinct customer_first_name)
0                                    26

In [54]:
%sql select * from farmers_market.customer

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

    customer_id customer_first_name customer_last_name customer_zip
0             1                Jane             Connor        22801
1             2              Manuel               Diaz        22821
2             3                 Bob             Wilson        22821
3             4              Deanna         Washington        22801
4             5             Abigail             Harris        22801
5             6               Betty            Bullard        22801
6             7             Jessica            Armenta        22821
7             8               Norma         Valenzuela        22821
8             9               Janet             Forbes        22801
9            10             Russell            Edwards        22801
10           11             Richard            Paulson        22801
11           12                Jack               Wise        22821
12           13              Jeremy             Gruber        22821
13           14             William              Lopes        22801
14           15             Darrell            Messina        22801
15           16                 Ada             Nieves        22801
16           17              Carlos               Diaz        22802
17           18                Jeri           Mitchell        22802
18           19                 Iva           Kienzler        22802
19           20             Valerie             Loftis        22802
20           21               Duane               Sipp        22801
21           22              George                Rai        22801
22           23               Alvin             Laurie        22801
23           24                Dawn               Nale        22801
24           25              Bonnie             Hassan        22801
25           26              Tracie           Goehring        22821

In [189]:
%sql show tables from farmers_market

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [ ]:
# The next task is to join all the tables and make one out of it

In [56]:
%sql create table sales_log ( item int primary key, sale_amount decimal(12,2)) into smart_data

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'into smart_data' at line 1")
[SQL: create table sales_log ( item int primary key, sale_amount decimal(12,2)) into smart_data]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [58]:
list1=list(range(2,6))
list2=list(range(3,6))
list1 in list2

False

In [59]:
[3,4,5] in list1

False

In [60]:
3 in list1

True

In [204]:
customer_data=%sql select * from farmers_market.customer
customer_data_frame=pd.DataFrame(customer_data)
customer_data_frame

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
26 rows affected.

    customer_id customer_first_name customer_last_name customer_zip
0             1                Jane             Connor        22801
1             2              Manuel               Diaz        22821
2             3                 Bob             Wilson        22821
3             4              Deanna         Washington        22801
4             5             Abigail             Harris        22801
5             6               Betty            Bullard        22801
6             7             Jessica            Armenta        22821
7             8               Norma         Valenzuela        22821
8             9               Janet             Forbes        22801
9            10             Russell            Edwards        22801
10           11             Richard            Paulson        22801
11           12                Jack               Wise        22821
12           13              Jeremy             Gruber        22821
13           14             William              Lopes        22801
14           15             Darrell            Messina        22801
15           16                 Ada             Nieves        22801
16           17              Carlos               Diaz        22802
17           18                Jeri           Mitchell        22802
18           19                 Iva           Kienzler        22802
19           20             Valerie             Loftis        22802
20           21               Duane               Sipp        22801
21           22              George                Rai        22801
22           23               Alvin             Laurie        22801
23           24                Dawn               Nale        22801
24           25              Bonnie             Hassan        22801
25           26              Tracie           Goehring        22821

In [109]:
last_names=['Diaz' , 'Edwards', 'Wilson']
customer_data_frame['quantity']=range(26,52)
customer_data_frame[['customer_id','customer_last_name','customer_first_name']] [(customer_data_frame["customer_last_name"]=="Diaz") | (customer_data_frame["customer_first_name"]=="William")
]

    customer_id customer_last_name customer_first_name
1             2               Diaz              Manuel
13           14              Lopes             William
16           17               Diaz              Carlos

In [110]:
import numpy as np

np.random.random_sample(26).sum()

15.519180409387465

In [96]:
customer_data_frame

    customer_id customer_first_name customer_last_name customer_zip  quantity
0             1                Diaz             Connor        22801        26
1             2                Diaz               Diaz        22821        27
2             3                Diaz             Wilson        22821        28
3             4                Diaz         Washington        22801        29
4             5                Diaz             Harris        22801        30
5             6                Diaz            Bullard        22801        31
6             7                Diaz            Armenta        22821        32
7             8                Diaz         Valenzuela        22821        33
8             9                Diaz             Forbes        22801        34
9            10                Diaz            Edwards        22801        35
10           11                Diaz            Paulson        22801        36
11           12                Diaz               Wise        22821        37
12           13                Diaz             Gruber        22821        38
13           14                Diaz              Lopes        22801        39
14           15                Diaz            Messina        22801        40
15           16                Diaz             Nieves        22801        41
16           17                Diaz               Diaz        22802        42
17           18                Diaz           Mitchell        22802        43
18           19                Diaz           Kienzler        22802        44
19           20                Diaz             Loftis        22802        45
20           21                Diaz               Sipp        22801        46
21           22                Diaz                Rai        22801        47
22           23                Diaz             Laurie        22801        48
23           24                Diaz               Nale        22801        49
24           25                Diaz             Hassan        22801        50
25           26                Diaz           Goehring        22821        51

In [115]:
%%sql select * from farmers_market.customer
    where 
        customer_first_name in ('Bob','Ada','Jeri')
        or customer_last_name in ('Rai', 'Lopes', 'Daiz')
order by customer_last_name, customer_first_name

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   customer_id customer_first_name customer_last_name customer_zip
0           14             William              Lopes        22801
1           18                Jeri           Mitchell        22802
2           16                 Ada             Nieves        22801
3           22              George                Rai        22801
4            3                 Bob             Wilson        22821

In [121]:
%%sql select * from farmers_market.customer
    where 
        customer_first_name in ('Bob','Ada','Jeri')
        or customer_last_name in ('Rai', 'Lopes', 'Daiz')
order by customer_first_name desc, customer_last_name

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   customer_id customer_first_name customer_last_name customer_zip
0           14             William              Lopes        22801
1           18                Jeri           Mitchell        22802
2           22              George                Rai        22801
3            3                 Bob             Wilson        22821
4           16                 Ada             Nieves        22801

In [125]:
product_data_frame= %sql select * from farmers_market.product
product_data_frame

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
23 rows affected.

,product_id,product_name,product_size,product_category_id,product_qty_type
0,1,Habanero Peppers - Organic,medium,1,lbs
1,2,Jalapeno Peppers - Organic,small,1,lbs
2,3,Poblano Peppers - Organic,large,1,unit
3,4,Banana Peppers - Jar,8 oz,3,unit
4,5,Whole Wheat Bread,1.5 lbs,3,unit
5,6,Cut Zinnias Bouquet,medium,5,unit
6,7,Apple Pie,"10""",3,unit
7,8,Cherry Pie,"10""",3,unit
8,9,Sweet Potatoes,medium,1,lbs
9,10,Eggs,1 dozen,6,unit
10,11,Pork Chops,1 lb,6,lbs
11,12,Baby Salad Lettuce Mix - Bag,1/2 lb,1,unit
12,13,Baby Salad Lettuce Mix,1 lb,1,lbs
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None
15,16,Sweet Corn,Ear,1,unit
16,17,Carrots,sold by weight,1,lbs
17,18,Carrots - Organic,bunch,1,unit
18,19,Farmer's Market Resuable Shopping Bag,medium,7,unit
19,20,Homemade Beeswax Candles,"6""""",7,unit
20,21,Organic Cherry Tomatoes,pint,1,unit
21,22,Roma Tomatoes,medium,1,lbs
22,23,Maple Syrup - Jar,8 oz,2,unit

In [146]:
product_data_frame.loc[product_data_frame['product_size'].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None

In [151]:
product_data_frame[product_data_frame.map(lambda x:x==1)]

    product_id product_name product_size  product_category_id product_qty_type
0          1.0          NaN          NaN                  1.0              NaN
1          NaN          NaN          NaN                  1.0              NaN
2          NaN          NaN          NaN                  1.0              NaN
3          NaN          NaN          NaN                  NaN              NaN
4          NaN          NaN          NaN                  NaN              NaN
5          NaN          NaN          NaN                  NaN              NaN
6          NaN          NaN          NaN                  NaN              NaN
7          NaN          NaN          NaN                  NaN              NaN
8          NaN          NaN          NaN                  1.0              NaN
9          NaN          NaN          NaN                  NaN              NaN
10         NaN          NaN          NaN                  NaN              NaN
11         NaN          NaN          NaN                  1.0              NaN
12         NaN          NaN          NaN                  1.0              NaN
13         NaN          NaN          NaN                  1.0              NaN
14         NaN          NaN          NaN                  1.0              NaN
15         NaN          NaN          NaN                  1.0              NaN
16         NaN          NaN          NaN                  1.0              NaN
17         NaN          NaN          NaN                  1.0              NaN
18         NaN          NaN          NaN                  NaN              NaN
19         NaN          NaN          NaN                  NaN              NaN
20         NaN          NaN          NaN                  1.0              NaN
21         NaN          NaN          NaN                  1.0              NaN
22         NaN          NaN          NaN                  NaN              NaN

In [171]:
product_data_frame.loc[product_data_frame[product_data_frame.map(lambda x:x==0)],:]

ValueError: Cannot index with multidimensional key

In [173]:
product_data_frame.isna().sum()

product_id             0
product_name           0
product_size           1
product_category_id    0
product_qty_type       2
dtype: int64

In [174]:
product_data_frame.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
dtype: bool

In [175]:
product_data_frame.isna().any(axis=0)

product_id             False
product_name           False
product_size            True
product_category_id    False
product_qty_type        True
dtype: bool

In [176]:
product_data_frame["product_size"].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
Name: product_size, dtype: bool

In [183]:
product_data_frame.loc[ product_data_frame["product_size"].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None

In [182]:
product_data_frame.loc[ product_data_frame["product_qty_type"].isna(),:]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None

## IMP CONCEPT
#### In Pandas, to filter rows based on missing values (`NaN`), you use `.isna()` (or `.isnull()`) to get a DataFrame of boolean values, and then apply `.any(axis=1)` to perform a row-wise logical OR—returning `True` for rows with at least one missing value. This results in a 1D boolean Series, which is exactly what's needed for row filtering. You can then use `.loc[]` like `df.loc[df.isna().any(axis=1), :]` to select those rows, or add a second argument to select specific columns. Similarly, `.all(axis=1)` gives `True` only if all values in the row are missing. This approach ensures readable, accurate filtering when dealing with incomplete data.

In [186]:
product_data_frame.loc[product_data_frame.isna().any(axis=1)]

,product_id,product_name,product_size,product_category_id,product_qty_type
13,14,Red Potatoes,None,1,None
14,15,Red Potatoes - Small,,1,None

In [185]:
# any will make multi Dimensional boolean values of column into one single list in any direction
# either rows axis=1 or column axis=0 as below using logical OR operation
product_data_frame.isna().any()

product_id             False
product_name           False
product_size            True
product_category_id    False
product_qty_type        True
dtype: bool

In [200]:
product_data_frame.isna().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
dtype: bool

In [198]:
%sql show tables from farmers_market

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
8 rows affected.

   Tables_in_farmers_market
0                     booth
1                  customer
2        customer_purchases
3          market_date_info
4                   product
5          product_category
6                    vendor
7  vendor_booth_assignments

In [199]:
%%sql select * from farmers_market.customer
where customer_first_name ='Jane'

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
1 rows affected.

   customer_id customer_first_name customer_last_name customer_zip
0            1                Jane             Connor        22801

In [ ]:
# in sql blank space is not null so use TRIM to remove blank space to make null. use together like 
'''
product_size IS NULL
             OR TRIM(product_size) = ''
'''

In [ ]:
# Just like we did in pandas how we locate all the null value columns in sql?

In [218]:
query='''   select product_id, product_name 
             from farmers_market.product
             '''
product= %sql $query
product

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
23 rows affected.

    product_id                           product_name
0            1             Habanero Peppers - Organic
1            2             Jalapeno Peppers - Organic
2            3              Poblano Peppers - Organic
3            4                   Banana Peppers - Jar
4            5                      Whole Wheat Bread
5            6                    Cut Zinnias Bouquet
6            7                              Apple Pie
7            8                             Cherry Pie
8            9                         Sweet Potatoes
9           10                                   Eggs
10          11                             Pork Chops
11          12           Baby Salad Lettuce Mix - Bag
12          13                 Baby Salad Lettuce Mix
13          14                           Red Potatoes
14          15                   Red Potatoes - Small
15          16                             Sweet Corn
16          17                                Carrots
17          18                      Carrots - Organic
18          19  Farmer's Market Resuable Shopping Bag
19          20               Homemade Beeswax Candles
20          21                Organic Cherry Tomatoes
21          22                          Roma Tomatoes
22          23                      Maple Syrup - Jar

In [225]:
query='''   select product_id, product_name 
             from farmers_market.product
             order by product_name
             limit 5
             '''
%sql $query

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   product_id                  product_name
0           7                     Apple Pie
1          13        Baby Salad Lettuce Mix
2          12  Baby Salad Lettuce Mix - Bag
3           4          Banana Peppers - Jar
4          17                       Carrots

In [227]:
query='''   select product_id, product_name 
             from farmers_market.product
             order by product_id desc
             limit 5
             '''
%sql $query

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

   product_id                           product_name
0          23                      Maple Syrup - Jar
1          22                          Roma Tomatoes
2          21                Organic Cherry Tomatoes
3          20               Homemade Beeswax Candles
4          19  Farmer's Market Resuable Shopping Bag

In [228]:
query2='''
SELECT market_date, vendor_id, booth_number
  FROM farmers_market.vendor_booth_assignments
  ORDER BY market_date, vendor_id
  LIMIT 5
'''
%sql $query2

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

  market_date  vendor_id  booth_number
0  2019-04-03          1             2
1  2019-04-03          3             1
2  2019-04-03          4             7
3  2019-04-03          7            11
4  2019-04-03          8             6

In [229]:
query2='''
SELECT market_date, vendor_id, booth_number
  FROM farmers_market.vendor_booth_assignments
  ORDER BY  vendor_id
  LIMIT 5
'''
%sql $query2

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
5 rows affected.

  market_date  vendor_id  booth_number
0  2019-04-03          1             2
1  2019-04-06          1             2
2  2019-04-13          1             2
3  2019-04-17          1             2
4  2019-04-20          1             2

In [233]:
quer3='''
SELECT
       market_date,
       customer_id,
       vendor_id,
       quantity,
       cost_to_customer_per_qty
  FROM farmers_market.customer_purchases
  
'''

In [234]:
%sql $quer3

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
4221 rows affected.

     market_date  customer_id  vendor_id quantity cost_to_customer_per_qty
0     2019-07-03           14          7     0.99                     6.99
1     2019-07-03           14          7     2.18                     6.99
2     2019-07-03           15          7     1.53                     6.99
3     2019-07-03           16          7     2.02                     6.99
4     2019-07-03           22          7     0.66                     6.99
...          ...          ...        ...      ...                      ...
4216  2020-09-30            4          4     2.00                     0.50
4217  2020-09-30           11          4     1.00                     0.50
4218  2020-09-30           16          4     5.00                     0.50
4219  2020-09-30           18          4     6.00                     0.50
4220  2020-09-30           18          4     4.00                     0.50

[4221 rows x 5 columns]

In [238]:
query4='''
SELECT
       market_date,
       customer_id,
       vendor_id,
       
       sum(quantity* cost_to_customer_per_qty) as total_customer_expense
  FROM farmers_market.customer_purchases
  group by market_date,customer_id, vendor_id
'''
%sql $query4

   mysql+pymysql://root:***@localhost:3306/demo
 * mysql+pymysql://root:***@localhost:3306/farmers_market
2727 rows affected.

     market_date  customer_id  vendor_id total_customer_expense
0     2019-07-03           14          7                42.1583
1     2019-07-03           15          7                10.6947
2     2019-07-03           16          7                38.6952
3     2019-07-03           22          7                 7.1134
4     2019-07-06            4          7                17.8873
...          ...          ...        ...                    ...
2722  2020-09-26           24          4                 2.0000
2723  2020-09-30            4          4                 4.6000
2724  2020-09-30           11          4                 0.5000
2725  2020-09-30           16          4                 2.5000
2726  2020-09-30           18          4                 5.0000

[2727 rows x 4 columns]